In [1]:
import pandas as pd 
import numpy as np

In [19]:
df1 = pd.DataFrame([[1,2,3,4], [5,6,7,8], [9,10,11,12], [13,14,15,16], [17,18,19,20]], columns=['a','b','c','d'])
df1

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [6]:
df1.head(2)d

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [7]:
df1.tail(2)

    0   1   2   3
3  13  14  15  16
4  17  18  19  20

In [10]:
df1.shape

(5, 4)

In [16]:
df1.iloc[0:2, 1:3]

   1  2
0  2  3
1  6  7